library/programming/tex/org-beamer/L03-C.tex
% Created 2011-05-19 Thu 03:51
\documentclass[10pt, t]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{APC524b}
\providecommand{\alert}[1]{\textbf{#1}}

\title{C}
\author{robert lupton\thanks{LooChao@gmail.com}}
\date{23 september 2010}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}

\section{Introduction}
\label{sec-1}
\subsection{types}
\label{sec-1_1}
\begin{frame}
\frametitle{Introduction}
\label{sec-1_1_1}

C was designed as a system programming language, to remove the necessity of writing operating systems in
assembler.  It's one of the large family of languages deriving from Algol.

\pause
You've seen ``hello world'' before:
CANNOT INCLUDE FILE src/hello.c
\pause

This example comes from ``The C Programming Language'' by Brian Kernighan and Dennis Ritchie (``K\&R'')
\end{frame}
\begin{frame}[fragile]
\frametitle{Declarations}
\label{sec-1_1_2}

 All variables must be declared before they can be used:
\begin{verbatim}
char c = 'a';
char *s = "I am a string";
double d = 1;
float f = 1.0f;
int i = 101010101;
long l = 10;
short s = 10;
\end{verbatim}
\pause
``string'' is spelt \code{char *} for reasons that I'll explain in a bit.
\pause
\code{short} is actually a shorthand for \code{short int} (\code{long} means \code{long int}).  
You can also define integral types (\code{char} and \code{int}) as being \code{signed} or \code{unsigned}. 
\pause One especially useful qualifier is \code{const}:
\begin{verbatim}
const unsigned long bad = 0xdeadbeef00000000;
\end{verbatim}

\pause An unqualified \code{int} is supposed to be the most efficient integral type on your machine, and is
what you'd generally use unless there was some reason not to. 
\end{frame}
\begin{frame}[fragile]
\frametitle{Declaring your own types}
\label{sec-1_1_3}

C allows you to use your own name for a type:
\begin{verbatim}
typedef unsigned short U16;
\end{verbatim}
\pause
Why would I want to do this?

\pause
CCD image data is typically created using a 16-bit A/D converter, so
the natural type for a single pixel is a 2-byte integer.

But C doesn't tell me how large an \code{int} is; I 
can find out (using \code{sizeof(int)}) but I don't want to have to change all my declarations when I move
to a new system.

\pause
Actually, these days, I could say:
\begin{verbatim}
#include <stdint.h>
typedef uint16_t U16;
\end{verbatim}
but even that only works if the processor actually has an unsigned 16-bit type.
\end{frame}
\begin{frame}[fragile]
\frametitle{Declarations}
\label{sec-1_1_4}

You can mix code and declarations:
\begin{verbatim}
int pwv = 0;                            // Precipitable Water Vapour
/*
 * Estimate the PWV based on the altitude
 */
...;
/*
 * Given that estimate, find a better value
 */
const int pwv0 = pwv;                   /* initial estimate of pwv */
\end{verbatim}
\pause
The ability to declare variables when they are first needed means that you can usually initialize them too;
when possible, make them \code{const}.
\end{frame}
\begin{frame}[fragile]
\frametitle{Scope}
\label{sec-1_1_5}

A variable's \emph{scope} is the part of the programme it may be referenced from;  in C, a variable's scope
is the nearest set of braces (\code{\{\}}), a \emph{block}.  If it isn't in a block, a variable is visible globally
(i.e. it'll show up when you run \code{nm} on your object file).  If this isn't what you wanted, you can:
 \pause

\begin{itemize}
\item Move it into a function --- remember, global variables should usually be avoided
\end{itemize}
 \pause

\begin{itemize}
\item Label it \code{static} which makes it only visible within the file
\end{itemize}
 \pause

\begin{itemize}
\item Decide that it really \emph{must} be globally visible, and declare it in a header file:
\begin{verbatim}
extern int nread;     // Number of times I've read from a file
\end{verbatim}
\end{itemize}

\pause
It is generally a good idea to declare a variable in as restricted a scope as possible (the ``No Globals'' rule 
is a special case of this one).
\end{frame}
\section{Program Structure}
\label{sec-2}
\subsection{\texttt{for}, \texttt{if}, \ldots{}}
\label{sec-2_1}
\begin{frame}
\frametitle{Control Flow}
\label{sec-2_1_1}


C has the usual constructs:

\begin{itemize}
\item \code{if(...) \{ ... \} else if(...) \{ ...\} else \{ ... \}}
\end{itemize}
 \pause

\begin{itemize}
\item \code{for(...) \{ ... \}}
\item \code{while \{ ... \}}
\item \code{do \{ ... \} while (...);}
\end{itemize}
 \pause

\begin{itemize}
\item \code{switch (...) \{ case XXX: ... break; ... \} }
\end{itemize}
 \pause

\begin{itemize}
\item \code{break}, \code{continue}
\end{itemize}
 \pause

\begin{itemize}
\item \code{goto}
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{If statements}
\label{sec-2_1_2}

\begin{verbatim}
if (i < 9) {
    printf("Hello");
} else {
    printf("Goodbye");
}
printf(" world\n");
\end{verbatim}
\pause
Legally, you can write this as
\begin{verbatim}
if (i < 9)
    printf("Hello");
else
    printf("Goodbye");

printf(" world\n");
\end{verbatim}
But we don't recommend it;
\pause  it's too easy to write
\begin{verbatim}
if (i < 9)
    printf("Hello");
else
    printf("Goodbye");
    printf(" and good riddance");

printf(" world\n");
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{For loops}
\label{sec-2_1_3}

CANNOT INCLUDE FILE src/for.c
This only works with a compiler that supports the C99 standard (\code{cc --std=c99 ...})
\pause
This is almost equivalent to:
\begin{verbatim}
#include <stdio.h>

int
main()
{
     int i = 0;
     while (i != 10) {
          printf("Hello world\n");
          ++i;
     }

     return 0;
}
\end{verbatim}
\end{frame}
\begin{frame}[allowframebreaks]
\frametitle{Switch}
\label{sec-2_1_4}

CANNOT INCLUDE FILE src/printf.c
\end{frame}
\begin{frame}[fragile]
\frametitle{Switch}
\label{sec-2_1_5}

\begin{verbatim}
$ make printf && ./printf
$ cc -g -Wall -O3 --std=c99    printf.c   -o printf
a
b
c
:
<space>
<integer>
%
<space>
d
o
n
e
<newline>
\end{verbatim}
(N.b. The call was \code{checkFormat("abc: \%d\%\% done\\n");})
\end{frame}
\begin{frame}
\frametitle{Putting that together}
\label{sec-2_1_6}

CANNOT INCLUDE FILE src/switch.c
\end{frame}
\section{Functions}
\label{sec-3}
\subsection{subroutines, arrays, operators}
\label{sec-3_1}
\begin{frame}
\frametitle{Subroutines}
\label{sec-3_1_1}

Here is a function to add two numbers:

\snippetFile[C++]{src/c_examples.c}

\includeSnippet{add}
\pause
and here is one to multiply them:

\includeSnippet{mult}

\pause
So far, just like Fortran

\pause
\includeSnippet{square}

\pause
That's a little clumsier --- in Fortran (or python) you could have said \code{x**2}.  And 
note the extra include file, \file{math.h}.  In the old days you needed to link \code{-lm} too, but modern 
systems seem to be more forgiving.
\end{frame}
\begin{frame}
\frametitle{Recursion}
\label{sec-3_1_2}

Subroutines may be called recursively --- that is, they may call themselves, either directly or indirectly.
There is no limit except the capacity of your computer.
CANNOT INCLUDE FILE src/factorial.c
\end{frame}
\begin{frame}[fragile]
\frametitle{Recursion}
\label{sec-3_1_3}

That may not seem very interesting; it's easy enough to write a loop to calculate factorials.  

However, consider a routine \code{integrate(float a, float b, float (*func)(float x))} \footnote{\code{float (*func)(float x)} is C for ``a function \texttt{func} expecting a float and returning a float'' }

\pause

If I need to do a double integral, I can say something like:
\begin{verbatim}
static float yy;                        // current value of y

static float func(float x) {
   return sin(x)*cos(yy);
}

static float dfunc(float y) {
   yy = y;                              // pass y to func
   return integrate(0, y, func);
}

const double ans = integrate(1, 3, dfunc);
\end{verbatim}

to calculate
$$
\int_{x=0}^{y} \int_{y=1}^{3} \sin x \cos y \,  d\!x d\!y
$$
\end{frame}
