library/tex/L03-C.org
*** Complete Example
#+BEGIN_SRC c
#include <stdio.h>
#include <math.h>

double integrate(const float a, const float b, float (*func)(float x)) {
      const int nstep = 1000;		// number of steps
      const float step = (b - a)/nstep;

      double ans = 0.0;
      float x = a;
      for (int i = 0; i != nstep; ++i) {
	 ans += func(x); 
	 x += step;
      }

      return step*ans;
}

static float yy;			// current value of y

static float func(float x) {
   return sin(x)*cos(yy);
}

static float dfunc(float y) {
   yy = y;				// pass y to func
   return integrate(0, y, func);
}

int main() {
   printf("ans = %g\n", integrate(1, 3, dfunc));
   return 0;
}
#+END_SRC

*** Subroutine Arguments
Question: What does this do?
#+BEGIN_SRC c
void triple(double x) {
   x *= 3;
}
...
double x = 1;
triple(x);
#+END_SRC
\pause
Answer: wastes CPU cycles.

The function \code{triple} is passed a /copy/ of \code{x}, so *nothing* that \code{triple} does can 
affect the program that calls it.

\pause
The solution is to pass a /pointer/ to x:
#+BEGIN_SRC c
void triple(double @\color{red}*@x) {
    @\color{red}*@x *= 3;
}
...
double x = 1;
triple(@\color{red}\&@x);
#+END_SRC
\pause
Fortran /always/ passes arguments this way; a famous party trick when I was young was to say
#+BEGIN_SRC c
call triple(1)
#+END_SRC
*** Prototypes
It is critically important that subroutines' callers and callees agree about the number and
types of the arguments (the /signature/).  C uses a /prototype/ to allow the compiler to check; given
#+BEGIN_SRC c
void triple(double *x) {
    *x *= 3;
}
#+END_SRC
we put the prototype \code{void triple(double *x);} in a header (".h") file and \code{#include} 
it in the file that defines \code{triple} and also whenever we call
\code{triple}. [fn:: Most compilers these days will complain if you don't do this.]

This isn't a lot of extra work and soon becomes second nature.

*** Arrays
Arrays are declared and subscripted using \code{[]}.
#+BEGIN_SRC c
int ids[10];
#+END_SRC 
\pause
In C99, the dimension need /not/ be known at compile time:
#+BEGIN_SRC c
void foo(const int n) {
    int ids[n];
    ...
    double x = ids[n/2];
}
#+END_SRC
The index starts at /0/ (not /1/, as in Fortran) as it specifies the distance from the start of the array.
#+BEGIN_SRC c
printf("ID0: %d\n", ids[0]);
#+END_SRC
\pause
This may make more sense when we discuss /pointers/.

*** =n=-D Arrays
You can also define =n=-D arrays:
#+BEGIN_SRC c
U16 data[4096][2048];
...
U16 const peak = data[y][x];		// the (x, y)th pixel
#+END_SRC

The data is stored row-by-row so the /last/ index increases fastest if we access pixels in the order in which
they're stored (unlike Fortran arrays, in which the /first/ index varies fastest).

\pause
=n=-D arrays aren't as useful as you might think as they are passed to
subroutines as /pointers/; for now all you need to know is that you *must* specify
all but the first dimension when passing an =n=-D array to a subroutine:
#+BEGIN_SRC c
void debias(U16 data[][2048], const int nrow, const int ncol) {
   ...
}
#+END_SRC
\pause (hmm, I seem to have typed \code{2048} twice; was that a good idea...?)

*** Operator Precedence
\newcommand{\pipe}{|}
|------------------------------------------------------------+---------------|
| operator                                                   | associativity |
|------------------------------------------------------------+---------------|
| =()= =[]= =->= =.=                                         | left to right |
| \texttt{!} =~= =++= \texttt{-}\texttt{-} =-= =(type)= =*= =&= =sizeof()=    | right to left |
| \texttt{*} =/= =%=                                         | left to right |
| \texttt{+} =-=                                             | left to right |
| \texttt{<}\texttt{<} \texttt{>}\texttt{>}                  | left to right |
| \texttt{<} \texttt{<=} \texttt{>} \texttt{>=}              | left to right |
| \texttt{==} \texttt{!=}                                    | left to right |
| \texttt{\&}                                                | left to right |
| =^=                                                        | left to right |
| \texttt{\pipe}                                             | left to right |
| \texttt{\&\&}                                              | left to right |
| \texttt{\pipe\pipe}                                        | left to right |
| \texttt{?:}                                                | right to left |
| \texttt{=} \texttt{+=} \texttt{-=} etc.                    | right to left |
| \texttt{,}                                                 | left to right |
|------------------------------------------------------------+---------------|

* Macros
** =#if=, =#define=
*** Macros and the C Pre-Processor (/CPP/)
C provides a simple macro processor which can be used to keep /magic numbers/ out of your
code[fn:: In \CPP you'd probably use a \code{const} variable but scoping rules are different in C, so a macro is appropriate]
instead of
#+BEGIN_SRC c
  char configFile[21];                    // name of configuration file
  fgets(stdin, fileName, 20);
#+END_SRC
\pause
you can write
#+BEGIN_SRC c
  #define FILE_LEN 20                     // maximum length for filename
  
  char configFile[FILE_LEN + 1];          // name of configuration file
  fgets(stdin, fileName, FILE_LEN);
#+END_SRC
\pause writing all macros in CAPITALS is a common convention.

*** Conditional Compilation
In the bad old days, we wrote lots of code like:
#+BEGIN_SRC c
    #if defined(vms)
       return -1;
    #elif defined(HAVE_SELECT) && !defined(USE_POLL)
       if(select(ncheck,&mask,(fd_set *)NULL,(fd_set *)NULL,
                 (void *)NULL) != 0) {
            ...
       }
    #else
      /* Use poll() */
    #endif
#+END_SRC 
\pause
Fortunately, in these days of [[http://www.opengroup.org/onlinepubs/009695399/][Posix]] (=IEEE 1003=; =ISO/IEC 9945=) there is much less need for of this sort of thing.
\pause 
The (or at least my) main use of the CPP is:
#+BEGIN_SRC c
  #define DEBUG 1
  ...
  #if DEBUG
  int niter = 0;
  #endif
  ...
  #if DEBUG
  printf("niter %d\n", ++niter);
  #endif
#+END_SRC
*** Good uses for macros I
One standard use for macros is to prevent header files being parsed more than once
#+BEGIN_SRC C
 #if !defined(GREET_H)
 #define GREET_H
 /* Lots of stuff that should be processed only once */
 #endif
#+END_SRC

This use of a macro is known as an /include guard/.
