library/programming/tex/org-beamer/L03-C.tex
\begin{frame}[fragile]
\frametitle{Complete Example}
\label{sec-3_1_4}

\begin{verbatim}
#include <stdio.h>
#include <math.h>

double integrate(const float a, const float b, float (*func)(float x)) {
      const int nstep = 1000;           // number of steps
      const float step = (b - a)/nstep;

      double ans = 0.0;
      float x = a;
      for (int i = 0; i != nstep; ++i) {
         ans += func(x); 
         x += step;
      }

      return step*ans;
}

static float yy;                        // current value of y

static float func(float x) {
   return sin(x)*cos(yy);
}

static float dfunc(float y) {
   yy = y;                              // pass y to func
   return integrate(0, y, func);
}

int main() {
   printf("ans = %g\n", integrate(1, 3, dfunc));
   return 0;
}
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Subroutine Arguments}
\label{sec-3_1_5}

Question: What does this do?
\begin{verbatim}
void triple(double x) {
   x *= 3;
}
...
double x = 1;
triple(x);
\end{verbatim}
\pause
Answer: wastes CPU cycles.

The function \code{triple} is passed a \emph{copy} of \code{x}, so \textbf{nothing} that \code{triple} does can 
affect the program that calls it.

\pause
The solution is to pass a \emph{pointer} to x:
\begin{verbatim}
void triple(double @\color{red}*@x) {
    @\color{red}*@x *= 3;
}
...
double x = 1;
triple(@\color{red}\&@x);
\end{verbatim}
\pause
Fortran \emph{always} passes arguments this way; a famous party trick when I was young was to say
\begin{verbatim}
call triple(1)
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Prototypes}
\label{sec-3_1_6}

It is critically important that subroutines' callers and callees agree about the number and
types of the arguments (the \emph{signature}).  C uses a \emph{prototype} to allow the compiler to check; given
\begin{verbatim}
void triple(double *x) {
    *x *= 3;
}
\end{verbatim}
we put the prototype \code{void triple(double *x);} in a header (``.h'') file and \code{#include} 
it in the file that defines \code{triple} and also whenever we call
\code{triple}. \footnote{Most compilers these days will complain if you don't do this. }

This isn't a lot of extra work and soon becomes second nature.
\end{frame}
\begin{frame}[fragile]
\frametitle{Arrays}
\label{sec-3_1_7}

Arrays are declared and subscripted using \code{[]}.
\begin{verbatim}
int ids[10];
\end{verbatim}
\pause
In C99, the dimension need \emph{not} be known at compile time:
\begin{verbatim}
void foo(const int n) {
    int ids[n];
    ...
    double x = ids[n/2];
}
\end{verbatim}
The index starts at \emph{0} (not \emph{1}, as in Fortran) as it specifies the distance from the start of the array.
\begin{verbatim}
printf("ID0: %d\n", ids[0]);
\end{verbatim}
\pause
This may make more sense when we discuss \emph{pointers}.
\end{frame}
\begin{frame}[fragile]
\frametitle{\texttt{n}-D Arrays}
\label{sec-3_1_8}

You can also define \texttt{n}-D arrays:
\begin{verbatim}
U16 data[4096][2048];
...
U16 const peak = data[y][x];            // the (x, y)th pixel
\end{verbatim}

The data is stored row-by-row so the \emph{last} index increases fastest if we access pixels in the order in which
they're stored (unlike Fortran arrays, in which the \emph{first} index varies fastest).

\pause
\texttt{n}-D arrays aren't as useful as you might think as they are passed to
subroutines as \emph{pointers}; for now all you need to know is that you \textbf{must} specify
all but the first dimension when passing an \texttt{n}-D array to a subroutine:
\begin{verbatim}
void debias(U16 data[][2048], const int nrow, const int ncol) {
   ...
}
\end{verbatim}
\pause (hmm, I seem to have typed \code{2048} twice; was that a good idea\ldots{}?)
\end{frame}
\begin{frame}
\frametitle{Operator Precedence}
\label{sec-3_1_9}

\newcommand{\pipe}{|}

\begin{center}
\begin{tabular}{ll}
\hline
 operator                                                                                                                                    &  associativity  \\
\hline
 \texttt{()} \texttt{[]} \texttt{->} \texttt{.}                                                                                              &  left to right  \\
 \texttt{!} \texttt{\textasciitilde{}} \texttt{++} \texttt{-}\texttt{-} \texttt{-} \texttt{(type)} \texttt{*} \texttt{\&} \texttt{sizeof()}  &  right to left  \\
 \texttt{*} \texttt{/} \texttt{\%}                                                                                                           &  left to right  \\
 \texttt{+} \texttt{-}                                                                                                                       &  left to right  \\
 \texttt{<}\texttt{<} \texttt{>}\texttt{>}                                                                                                   &  left to right  \\
 \texttt{<} \texttt{<=} \texttt{>} \texttt{>=}                                                                                               &  left to right  \\
 \texttt{==} \texttt{!=}                                                                                                                     &  left to right  \\
 \texttt{\&}                                                                                                                                 &  left to right  \\
 \texttt{\textasciicircum{}}                                                                                                                 &  left to right  \\
 \texttt{\pipe}                                                                                                                              &  left to right  \\
 \texttt{\&\&}                                                                                                                               &  left to right  \\
 \texttt{\pipe\pipe}                                                                                                                         &  left to right  \\
 \texttt{?:}                                                                                                                                 &  right to left  \\
 \texttt{=} \texttt{+=} \texttt{-=} etc.                                                                                                     &  right to left  \\
 \texttt{,}                                                                                                                                  &  left to right  \\
\hline
\end{tabular}
\end{center}
\end{frame}
\section{Macros}
\label{sec-4}
\subsection{\texttt{\#if}, \texttt{\#define}}
\label{sec-4_1}
\begin{frame}[fragile]
\frametitle{Macros and the C Pre-Processor (\emph{CPP})}
\label{sec-4_1_1}

C provides a simple macro processor which can be used to keep \emph{magic numbers} out of your
code[3]
instead of
\begin{verbatim}
char configFile[21];                    // name of configuration file
fgets(stdin, fileName, 20);
\end{verbatim}
\pause
you can write
\begin{verbatim}
#define FILE_LEN 20                     // maximum length for filename

char configFile[FILE_LEN + 1];          // name of configuration file
fgets(stdin, fileName, FILE_LEN);
\end{verbatim}
\pause writing all macros in CAPITALS is a common convention.
\end{frame}
\begin{frame}[fragile]
\frametitle{Conditional Compilation}
\label{sec-4_1_2}

In the bad old days, we wrote lots of code like:
\begin{verbatim}
#if defined(vms)
   return -1;
#elif defined(HAVE_SELECT) && !defined(USE_POLL)
   if(select(ncheck,&mask,(fd_set *)NULL,(fd_set *)NULL,
             (void *)NULL) != 0) {
        ...
   }
#else
  /* Use poll() */
#endif
\end{verbatim}
\pause
Fortunately, in these days of \href{http://www.opengroup.org/onlinepubs/009695399/}{Posix} (\texttt{IEEE 1003}; \texttt{ISO/IEC 9945}) there is much less need for of this sort of thing.
\pause 
The (or at least my) main use of the CPP is:
\begin{verbatim}
#define DEBUG 1
...
#if DEBUG
int niter = 0;
#endif
...
#if DEBUG
printf("niter %d\n", ++niter);
#endif
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Good uses for macros I}
\label{sec-4_1_3}

One standard use for macros is to prevent header files being parsed more than once
\begin{verbatim}
#if !defined(GREET_H)
#define GREET_H
/* Lots of stuff that should be processed only once */
#endif
\end{verbatim}

This use of a macro is known as an \emph{include guard}.
\end{frame}
