library/tex/L03-C.org
*** Good uses for macros II
#+INCLUDE src/macros.c src c
\pause
#+BEGIN_SRC sh
$ make macros && macros 1 2 3
cc -g -Wall --std=c99 macros.c -o macros
macros.c:009: Hello world!
macros.c:010: My name is macros and I was called with 3 arguments.
#+END_SRC 

\pause
Unfortunately, this code does not conform to the C99 standard (=ISO 9899:1999=):
#+BEGIN_SRC sh
$ cc -g -Wall --std=c99 --pedantic-errors macros.c -o macros
macros.c:3:29: error: ISO C does not permit named variadic macros
macros.c:7:30: error: ISO C99 requires rest arguments to be used
#+END_SRC

*** Good uses for macros II
A legal version is:
#+INCLUDE src/macros2.c src c
Note that we were forced to pass at least one argument (hence the \code{""} in the first call).
*** Bad uses for macros I
You can use the CPP to pretend that you're writing Algol, not C
#+BEGIN_SRC c
#define IF	if(
#define THEN	){
#define ELSE	} else {
#define ELIF	} else if (
#define FI	;}

IF x == 0 THEN
   printf("zero\n");
ELIF x == 1 THEN
   printf("one\n");
ELSE
   printf("many\n");
FI
#+END_SRC
\pause
These macros come from the original Bourne shell source code in Unix Version 7.
*** Bad uses for macros II
How about
#+BEGIN_SRC c
#define MAX(a,b)	((a)>(b)?(a):(b))
#+END_SRC
This one also comes from Steve Bourne.

\pause
Why is this bad?  Consider
#+BEGIN_SRC c
const double fg = MAX(funcs(x), gunks(x));
#+END_SRC
\pause
#+BEGIN_SRC c
double funcs(const double x) {
   static int x = 0.5;
   x = sin(x);
   return x;
}

static int i = 0;
double gunks(const double x) {
   return (x < ++i) ? 5.6 : 5.9;
}
#+END_SRC 
\pause
Both \code{funcs} and \code{gunks} are called twice; this is always inefficient, but in this case
 catastrophic as they maintain internal state.

\pause
You don't write code like /that/, of course.  But \code{MAX(getchar(), 'a')} is just as bad.

\pause
C99 (and \CPP) have the \code{inline} keyword which removes some of the desire for macros like this.
* Structs and Memory
** =struct=, the stack, =malloc=
*** Structs
If you routinely write code like:
#+BEGIN_SRC c
  void printObjects(const int n, const int id[],
                    const float xcen[], const float ycen[],
                    const float flux[]);

  #define NOBJECT 1000                    // Maximum number of objects

  int id[NOBJECT];                        // Object IDs
  float xcen[NOBJECT];                    // x-coordinate of centre
  float ycen[NOBJECT];                    // y-coordinate of centre
  float flux[NOBJECT];                    // object's flux
    
  for (int i = 0; i < n; ++i) {
     id[i] = i;
     xcen[i] = ...;
     ycen[i] = ...;
     flux[i] = ...;
  }
  
  printObjects(n, id, xcen, ycen, flux);
#+END_SRC
C and we can help.
*** Structs
A cleaner way to write this is:
#+BEGIN_SRC c
  struct Object {
     int id;                              // Object IDs
     float xcen;                          // x-coordinate of centre
     float ycen;                          // y-coordinate of centre
  };

  typedef struct Object Object;
  
  void printObjects(const int n, const Object objs[]);
  
  #define NOBJECT 1000                    // Maximum number of objects
  
  Object objs[NOBJECT];			  // our objects

  for (int i = 0; i < n; ++i) {
     objs[i].id = i;
     objs[i].xcen = ...;
     objs[i].ycen = ...;
  }
  
  printObjects(n, objs);
#+END_SRC
Now if we need to add more fields (e.g. \code{float flux;}) we don't need to 
change \code{printObjects}' signature.

\pause
The top of this example (down to \code{#define NOBJECT}) would usually be put in a 
header file with /include guards/
*** Memory Allocation
You should be a little uneasy about \code{NOBJECT} in that last example.  A number of questions come to mind:
- How did I know that I only had 1000 objects?  
- What would I do if I had more? 
- Am I wasting space if I have less?
\pause
and also
- Where is the computer putting all those IDs and positions?
*** Inside your job
A running program consists of a number of pieces:
  - \pause =text=  Our instructions and read-only data
  - \pause =data=  Initialised global data
  #+ Wiki: BSS (Block Started by Symbol) was a pseudo-operation in UA-SAP (United Aircraft Symbolic Assembly
  #+ Program), the assembler developed in the mid-1950s for the IBM 704
  - \pause =bss=   Uninitialized global data
  - \pause =stack= Memory for variables in subroutines
  - \pause =heap=  Memory available to the programmer

\pause
All of these are mapped into a single (logical) section of RAM:

#+ATTR_LaTeX: align=|*{8}{l|}
|---+--------------+------+------+-----+------+--------------+-------|
| # | \texttt{0x0} | text | data | bss | heap | \hspace{1cm} | stack |
|---+--------------+------+------+-----+------+--------------+-------|

(=0x0= is how you write a hexadecimal number in C (or \CPP))

*** Stack and Heap

It's traditional to think of the heap and stack as growing down and up respectively:

#+ATTR_LaTeX: align=|l|l|
|-------+--------------|
| heap  | $\downarrow$ |
|-------+--------------|
| \null |              |
|-------+--------------|
| stack | $\uparrow$   |
|-------+--------------|

*** The Stack

What happens when I call a function? E.g.
#+BEGIN_SRC c
double integrate(const float a, const float b, float (*func)(float x)) {
      const int nstep = 1000;		// number of steps
      const float step = (b - a)/nstep;
      ...
      ans += func(x);
}

double ans = integrate(1, 3, dfunc);
#+END_SRC
\pause
We first push the values of =a=, =b=, and =func= onto the stack:

#+ATTR_LaTeX: align=|c|
|------------------|
| \texttt{<dfunc>} |
|------------------|
| \texttt{3.0}     |
|------------------|
| \texttt{1.0}     |
|------------------|
|------------------|

# (=<dfunc>= is actually the address of the function)
\pause
We then make space for =step= and =nstep=

#+ATTR_LaTeX: align=|c|
|------------------|
| \texttt{???}     |
|------------------|
| \texttt{???}     |
|------------------|
| \texttt{<dfunc>} |
|------------------|
| \texttt{3.0}     |
|------------------|
| \texttt{1.0}     |
|------------------|
|------------------|

*** The Stack

We initialised =step= to =1000= and =nstep= to =(b - a)/nstep=, so:

#+ATTR_LaTeX: align=|c|
|------------------|
| \texttt{0.002}   |
|------------------|
| \texttt{1000}    |
|------------------|
| \texttt{<dfunc>} |
|------------------|
| \texttt{3.0}     |
|------------------|
| \texttt{1.0}     |
|------------------|
|------------------|
\pause

Within =integrate= we call =dfunc= with argument =x=; this pushes =x= (=1.0=) onto the stack:

#+ATTR_LaTeX: align=|c|
|------------------|
| \texttt{1.0}     |
|------------------|
|------------------|
| \texttt{0.002}   |
|------------------|
| \texttt{1000}    |
|------------------|
| \texttt{<dfunc>} |
|------------------|
| \texttt{3.0}     |
|------------------|
| \texttt{1.0}     |
|------------------|
|------------------|

