library/programming/tex/org-beamer/L03-C.tex
\begin{frame}[fragile]
\frametitle{Good uses for macros II}
\label{sec-4_1_4}

CANNOT INCLUDE FILE src/macros.c
\pause
\begin{verbatim}
$ make macros && macros 1 2 3
cc -g -Wall --std=c99 macros.c -o macros
macros.c:009: Hello world!
macros.c:010: My name is macros and I was called with 3 arguments.
\end{verbatim}

\pause
Unfortunately, this code does not conform to the C99 standard (\texttt{ISO 9899:1999}):
\begin{verbatim}
$ cc -g -Wall --std=c99 --pedantic-errors macros.c -o macros
macros.c:3:29: error: ISO C does not permit named variadic macros
macros.c:7:30: error: ISO C99 requires rest arguments to be used
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Good uses for macros II}
\label{sec-4_1_5}

A legal version is:
CANNOT INCLUDE FILE src/macros2.c
Note that we were forced to pass at least one argument (hence the \code{""} in the first call).
\end{frame}
\begin{frame}[fragile]
\frametitle{Bad uses for macros I}
\label{sec-4_1_6}

You can use the CPP to pretend that you're writing Algol, not C
\begin{verbatim}
#define IF      if(
#define THEN    ){
#define ELSE    } else {
#define ELIF    } else if (
#define FI      ;}

IF x == 0 THEN
   printf("zero\n");
ELIF x == 1 THEN
   printf("one\n");
ELSE
   printf("many\n");
FI
\end{verbatim}
\pause
These macros come from the original Bourne shell source code in Unix Version 7.
\end{frame}
\begin{frame}[fragile]
\frametitle{Bad uses for macros II}
\label{sec-4_1_7}

How about
\begin{verbatim}
#define MAX(a,b)        ((a)>(b)?(a):(b))
\end{verbatim}
This one also comes from Steve Bourne.

\pause
Why is this bad?  Consider
\begin{verbatim}
const double fg = MAX(funcs(x), gunks(x));
\end{verbatim}
\pause
\begin{verbatim}
double funcs(const double x) {
   static int x = 0.5;
   x = sin(x);
   return x;
}

static int i = 0;
double gunks(const double x) {
   return (x < ++i) ? 5.6 : 5.9;
}
\end{verbatim}
\pause
Both \code{funcs} and \code{gunks} are called twice; this is always inefficient, but in this case
 catastrophic as they maintain internal state.

\pause
You don't write code like \emph{that}, of course.  But \code{MAX(getchar(), 'a')} is just as bad.

\pause
C99 (and \CPP) have the \code{inline} keyword which removes some of the desire for macros like this.
\end{frame}
\section{Structs and Memory}
\label{sec-5}
\subsection{\texttt{struct}, the stack, \texttt{malloc}}
\label{sec-5_1}
\begin{frame}[fragile]
\frametitle{Structs}
\label{sec-5_1_1}

If you routinely write code like:
\begin{verbatim}
void printObjects(const int n, const int id[],
                  const float xcen[], const float ycen[],
                  const float flux[]);

#define NOBJECT 1000                    // Maximum number of objects

int id[NOBJECT];                        // Object IDs
float xcen[NOBJECT];                    // x-coordinate of centre
float ycen[NOBJECT];                    // y-coordinate of centre
float flux[NOBJECT];                    // object's flux
  
for (int i = 0; i < n; ++i) {
   id[i] = i;
   xcen[i] = ...;
   ycen[i] = ...;
   flux[i] = ...;
}

printObjects(n, id, xcen, ycen, flux);
\end{verbatim}
C and we can help.
\end{frame}
\begin{frame}[fragile]
\frametitle{Structs}
\label{sec-5_1_2}

A cleaner way to write this is:
\begin{verbatim}
struct Object {
   int id;                              // Object IDs
   float xcen;                          // x-coordinate of centre
   float ycen;                          // y-coordinate of centre
};

typedef struct Object Object;

void printObjects(const int n, const Object objs[]);

#define NOBJECT 1000                    // Maximum number of objects

Object objs[NOBJECT];                   // our objects

for (int i = 0; i < n; ++i) {
   objs[i].id = i;
   objs[i].xcen = ...;
   objs[i].ycen = ...;
}

printObjects(n, objs);
\end{verbatim}
Now if we need to add more fields (e.g. \code{float flux;}) we don't need to 
change \code{printObjects}' signature.

\pause
The top of this example (down to \code{#define NOBJECT}) would usually be put in a 
header file with \emph{include guards}
\end{frame}
\begin{frame}
\frametitle{Memory Allocation}
\label{sec-5_1_3}

You should be a little uneasy about \code{NOBJECT} in that last example.  A number of questions come to mind:

\begin{itemize}
\item How did I know that I only had 1000 objects?
\item What would I do if I had more?
\item Am I wasting space if I have less?
\end{itemize}
\pause
and also

\begin{itemize}
\item Where is the computer putting all those IDs and positions?
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Inside your job}
\label{sec-5_1_4}

A running program consists of a number of pieces:

\begin{itemize}
\item \pause \texttt{text}  Our instructions and read-only data
\item \pause \texttt{data}  Initialised global data
\end{itemize}

\begin{itemize}
\item \pause \texttt{bss}   Uninitialized global data
\item \pause \texttt{stack} Memory for variables in subroutines
\item \pause \texttt{heap}  Memory available to the programmer
\end{itemize}

\pause
All of these are mapped into a single (logical) section of RAM:


\begin{center}
\begin{tabular}{|*{8}{l|}}
\hline
 \texttt{0x0}  &  text  &  data  &  bss  &  heap  &  \hspace{1cm}  &  stack  \\
\hline
\end{tabular}
\end{center}



(\texttt{0x0} is how you write a hexadecimal number in C (or \CPP))
\end{frame}
\begin{frame}
\frametitle{Stack and Heap}
\label{sec-5_1_5}


It's traditional to think of the heap and stack as growing down and up respectively:


\begin{center}
\begin{tabular}{|l|l|}
\hline
 heap   &  $\downarrow$  \\
\hline
 \null  &                \\
\hline
 stack  &  $\uparrow$    \\
\hline
\end{tabular}
\end{center}
\end{frame}
\begin{frame}[fragile]
\frametitle{The Stack}
\label{sec-5_1_6}


What happens when I call a function? E.g.
\begin{verbatim}
double integrate(const float a, const float b, float (*func)(float x)) {
      const int nstep = 1000;           // number of steps
      const float step = (b - a)/nstep;
      ...
      ans += func(x);
}

double ans = integrate(1, 3, dfunc);
\end{verbatim}
\pause
We first push the values of \texttt{a}, \texttt{b}, and \texttt{func} onto the stack:


\begin{center}
\begin{tabular}{|c|}
\hline
 \texttt{<dfunc>}  \\
\hline
 \texttt{3.0}      \\
\hline
 \texttt{1.0}      \\
\hline
\hline
\end{tabular}
\end{center}



\pause
We then make space for \texttt{step} and \texttt{nstep}


\begin{center}
\begin{tabular}{|c|}
\hline
 \texttt{???}      \\
\hline
 \texttt{???}      \\
\hline
 \texttt{<dfunc>}  \\
\hline
 \texttt{3.0}      \\
\hline
 \texttt{1.0}      \\
\hline
\hline
\end{tabular}
\end{center}
\end{frame}
\begin{frame}
\frametitle{The Stack}
\label{sec-5_1_7}


We initialised \texttt{step} to \texttt{1000} and \texttt{nstep} to \texttt{(b - a)/nstep}, so:


\begin{center}
\begin{tabular}{|c|}
\hline
 \texttt{0.002}    \\
\hline
 \texttt{1000}     \\
\hline
 \texttt{<dfunc>}  \\
\hline
 \texttt{3.0}      \\
\hline
 \texttt{1.0}      \\
\hline
\hline
\end{tabular}
\end{center}


\pause

Within \texttt{integrate} we call \texttt{dfunc} with argument \texttt{x}; this pushes \texttt{x} (\texttt{1.0}) onto the stack:


\begin{center}
\begin{tabular}{|c|}
\hline
 \texttt{1.0}      \\
\hline
\hline
 \texttt{0.002}    \\
\hline
 \texttt{1000}     \\
\hline
 \texttt{<dfunc>}  \\
\hline
 \texttt{3.0}      \\
\hline
 \texttt{1.0}      \\
\hline
\hline
\end{tabular}
\end{center}
\end{frame}
