library/tex/L03-C.org
*** The Stack

within =dfunc= we calculate =y= (=1.0=) and call \code{integrate(0, y, func)} resulting in:

#+ATTR_LaTeX: align=|c|
|------------------|
| \texttt{0.001}   |
|------------------|
| \texttt{1000}    |
|------------------|
| \texttt{<func>}  |
|------------------|
| \texttt{1.0}     |
|------------------|
| \texttt{0.0}     |
|------------------|
|------------------|
| \texttt{1.0}     |
|------------------|
|------------------|
| \texttt{0.002}   |
|------------------|
| \texttt{1000}    |
|------------------|
| \texttt{<dfunc>} |
|------------------|
| \texttt{3.0}     |
|------------------|
| \texttt{1.0}     |
|------------------|
|------------------|

And so on.

*** The Stack

When =integrate= has calculated its return value, it puts it somewhere 
and /pops/ the stack:

#+ATTR_LaTeX: align=|c|
|------------------|
| \texttt{1.0}     |
|------------------|
|------------------|
| \texttt{0.002}   |
|------------------|
| \texttt{1000}    |
|------------------|
| \texttt{<dfunc>} |
|------------------|
| \texttt{3.0}     |
|------------------|
| \texttt{1.0}     |
|------------------|
|------------------|

\pause

=dfunc= puts /its/ return value somewhere, and pops the stack:

#+ATTR_LaTeX: align=|c|
|------------------|
| \texttt{0.002}   |
|------------------|
| \texttt{1000}    |
|------------------|
| \texttt{<dfunc>} |
|------------------|
| \texttt{3.0}     |
|------------------|
| \texttt{1.0}     |
|------------------|
|------------------|

\pause 

And finally the outer call to =integrate= finishes, saves its value, pops the stack, and we're
back where we started.

*** Subroutine Arguments Redux
It should now be clear that:
- A language can *only* pass variables by value if it wishes to support recursion
 [fn:: this isn't quite true;  it could pass a limited number of variables by using \textit{register}s]
- Variables in subroutines are irretrievably lost when the routine returns
- Uninitialized values may have any value
- (Almost) all variables are stored somewhere in the process's memory

\pause The last bullet suggests a way to work around the first one: we can push the variable's /address/ onto
the stack and agree to use not the value on the stack, but the value stored at that location.

\pause
In C, \code{&x} is =x='s address, and \code{*px} means "use the value stored at the address =px="

*** Pointers

A variable that holds an address is called a /pointer/; there's nothing magic about it;  it just happens 
that you can apply the \code{*} operator if you want to use the value it points to.

\pause
#+BEGIN_SRC c
int i = 0;
int *pi = &i;
printf("i = %d, %d\n", i, *pi);
*pi = 10;
printf("i = %d, %d\n", i, *pi);
#+END_SRC

\pause
If you haven't ensured that a pointer is set to a valid address, you're going to suffer.  If you say
#+BEGIN_SRC c
int *pi;
*pi = 10;
printf("i = %d\n", *pi);
#+END_SRC
your program may well (and should!) crash.
*** Arrays
By definition, given any type \code{type}
#+BEGIN_SRC c
int i;
type p[N];
p[i] == *(p + i);
p + i == &p[i]
#+END_SRC
\pause
i.e. adding an integer to a pointer gives you an address larger by \code{i*sizeof(type)}
\pause

E.g. \code{float} is usually a 4-byte real, so if \code{p} is \texttt{0xffff0000}, \code{p + 2} is \texttt{0xffff0008}.

\pause
In fact, whenever you refer to an array (\code{p}), it is treated as a pointer to the first element (\code{&p[0]}). 
This is why you can't pass an =n=-D array to a subroutine.

*** Strings

We introduced \code{char *} as a way of spelling "string" and we can now see how it works.

We can write \code{char str[7] = "abcdef";} [fn:: actually you can omit the dimension;
 it'll be calculated for you. You need to allow an extra character for the \code{'\\0'} that traditionally ends a string in C.]
\pause

The statement \code{char *str = "abcdef";} is analogous to \code{float *x = &xx;}, 
and \code{*str} is indeed \code{a}.
\pause

The difference between \code{char *str = "abcdef";} and \code{char str[7] = "abcdef";} is where the data is
actually stored; in the former case it's in the =data= segment, in the latter case it's on the stack.

*** Structs revisited

Convinced of the value of a =struct= such as
#+BEGIN_SRC c
  struct Object {
     int id;                              // Object IDs
     float xcen;                          // x-coordinate of centre
     float ycen;                          // y-coordinate of centre
  };

  typedef struct Object Object;
#+END_SRC
I wrote a convenience function:
#+BEGIN_SRC c
  Object *newObject(const int id, const float xcen, const double ycen) {
     Object obj;
  
     obj.id = id;
     obj.xcen = xcen;
     obj.ycen = ycen;
  
     return &obj;
  }
  #define NOBJECT 1000                    // Maximum number of objects
  
  Object *objs[NOBJECT];                  // our objects
  
  for (int i = 0; i < n; ++i) {
     objs[i] = newObject(i, ...);
  }
#+END_SRC

*** Malloc

After some time spent in =gdb=, I remembered: 
- Variables in subroutines are irretrievably lost when the routine returns
and that's exactly what this does:
#+BEGIN_SRC c
  Object *newObject(const int id, const float xcen, const double ycen) {
     Object obj;
     ...
     return @\color{red}\&@obj;
  }
#+END_SRC

\pause
The solution is to get a pointer to a piece of persistent memory.  
C provides this via a call to \code{malloc}:
#+BEGIN_SRC c
  #include <stdlib.h>

  Object *newObject(const int id, const float xcen, const double ycen) {
     Object @\color{red}*@obj = malloc(sizeof(Object));
     ...
     return obj;
  }
#+END_SRC
\pause
Malloc finds the memory you ask for on the =heap=.

*** Pointers-to-Pointers
How about:
#+BEGIN_SRC c
  #define NOBJECT 1000                    // Maximum number of objects
  
  Object *objs[NOBJECT];                  // our objects
#+END_SRC 
\pause

We know that
#+BEGIN_SRC c
int i[10];
#+END_SRC
and
#+BEGIN_SRC c
int *i;
#+END_SRC
are equivalent (except for the question of where the data lives).\pause{}
We can provide the needed storage with:
#+BEGIN_SRC c
int *i = malloc(10*sizeof(int));
#+END_SRC

\pause
So:
#+BEGIN_SRC c
  n = ...;
  Object **objs = malloc(n*sizeof(Object *)); // our objects
#+END_SRC 
\pause
If you don't know =n= /a priori/, look up the system call \code{realloc}.
\pause
There is also \code{calloc} but I never use it --- initialising to =0x0= is a blunt weapon.
*** Free
As I said, \code{malloc} returns persistent memory, so it's important to return it to the system
when you've finished with it:
#+BEGIN_SRC c
  for (int i = 0; i != n; ++i) {
     free(objects[i]);
  }
  free(objects);
#+END_SRC
\pause Failure to do so results in a /memory leak/.

\pause
Freeing a piece of memory more than once usually has catastrophic consequences; don't do it.

\pause
Another failure mode is that sometimes \code{malloc} can't give you the memory you want.  In this case it
returns =0=, conventionally written =NULL=.  There is not much you can do when this happens, so a reasonable
response is to abort:
#+BEGIN_SRC c
  #include <stdlib.h>
  #include <assert.h>
  
  Object *newObject(const int id, const float xcen, const double ycen) {
     Object @\color{red}*@obj = malloc(sizeof(Object));
     assert (obj != NULL);
     ...
     return obj;
  }
#+END_SRC

