library/programming/tex/org-beamer/L03-C.tex
\begin{frame}
\frametitle{The Stack}
\label{sec-5_1_8}


within \texttt{dfunc} we calculate \texttt{y} (\texttt{1.0}) and call \code{integrate(0, y, func)} resulting in:


\begin{center}
\begin{tabular}{|c|}
\hline
 \texttt{0.001}    \\
\hline
 \texttt{1000}     \\
\hline
 \texttt{<func>}   \\
\hline
 \texttt{1.0}      \\
\hline
 \texttt{0.0}      \\
\hline
\hline
 \texttt{1.0}      \\
\hline
\hline
 \texttt{0.002}    \\
\hline
 \texttt{1000}     \\
\hline
 \texttt{<dfunc>}  \\
\hline
 \texttt{3.0}      \\
\hline
 \texttt{1.0}      \\
\hline
\hline
\end{tabular}
\end{center}



And so on.
\end{frame}
\begin{frame}
\frametitle{The Stack}
\label{sec-5_1_9}


When \texttt{integrate} has calculated its return value, it puts it somewhere 
and \emph{pops} the stack:


\begin{center}
\begin{tabular}{|c|}
\hline
 \texttt{1.0}      \\
\hline
\hline
 \texttt{0.002}    \\
\hline
 \texttt{1000}     \\
\hline
 \texttt{<dfunc>}  \\
\hline
 \texttt{3.0}      \\
\hline
 \texttt{1.0}      \\
\hline
\hline
\end{tabular}
\end{center}



\pause

\texttt{dfunc} puts \emph{its} return value somewhere, and pops the stack:


\begin{center}
\begin{tabular}{|c|}
\hline
 \texttt{0.002}    \\
\hline
 \texttt{1000}     \\
\hline
 \texttt{<dfunc>}  \\
\hline
 \texttt{3.0}      \\
\hline
 \texttt{1.0}      \\
\hline
\hline
\end{tabular}
\end{center}



\pause 

And finally the outer call to \texttt{integrate} finishes, saves its value, pops the stack, and we're
back where we started.
\end{frame}
\begin{frame}
\frametitle{Subroutine Arguments Redux}
\label{sec-5_1_10}

It should now be clear that:

\begin{itemize}
\item A language can \textbf{only} pass variables by value if it wishes to support recursion
 [4]
\item Variables in subroutines are irretrievably lost when the routine returns
\item Uninitialized values may have any value
\item (Almost) all variables are stored somewhere in the process's memory
\end{itemize}

\pause The last bullet suggests a way to work around the first one: we can push the variable's \emph{address} onto
the stack and agree to use not the value on the stack, but the value stored at that location.

\pause
In C, \code{&x} is \texttt{x}'s address, and \code{*px} means ``use the value stored at the address \texttt{px}''
\end{frame}
\begin{frame}[fragile]
\frametitle{Pointers}
\label{sec-5_1_11}


A variable that holds an address is called a \emph{pointer}; there's nothing magic about it;  it just happens 
that you can apply the \code{*} operator if you want to use the value it points to.

\pause
\begin{verbatim}
int i = 0;
int *pi = &i;
printf("i = %d, %d\n", i, *pi);
*pi = 10;
printf("i = %d, %d\n", i, *pi);
\end{verbatim}

\pause
If you haven't ensured that a pointer is set to a valid address, you're going to suffer.  If you say
\begin{verbatim}
int *pi;
*pi = 10;
printf("i = %d\n", *pi);
\end{verbatim}
your program may well (and should!) crash.
\end{frame}
\begin{frame}[fragile]
\frametitle{Arrays}
\label{sec-5_1_12}

By definition, given any type \code{type}
\begin{verbatim}
int i;
type p[N];
p[i] == *(p + i);
p + i == &p[i]
\end{verbatim}
\pause
i.e. adding an integer to a pointer gives you an address larger by \code{i*sizeof(type)}
\pause

E.g. \code{float} is usually a 4-byte real, so if \code{p} is \texttt{0xffff0000}, \code{p + 2} is \texttt{0xffff0008}.

\pause
In fact, whenever you refer to an array (\code{p}), it is treated as a pointer to the first element (\code{&p[0]}). 
This is why you can't pass an \texttt{n}-D array to a subroutine.
\end{frame}
\begin{frame}
\frametitle{Strings}
\label{sec-5_1_13}


We introduced \code{char *} as a way of spelling ``string'' and we can now see how it works.

We can write \code{char str[7] = "abcdef";} [5]
\pause

The statement \code{char *str = "abcdef";} is analogous to \code{float *x = &xx;}, 
and \code{*str} is indeed \code{a}.
\pause

The difference between \code{char *str = "abcdef";} and \code{char str[7] = "abcdef";} is where the data is
actually stored; in the former case it's in the \texttt{data} segment, in the latter case it's on the stack.
\end{frame}
\begin{frame}[fragile]
\frametitle{Structs revisited}
\label{sec-5_1_14}


Convinced of the value of a \texttt{struct} such as
\begin{verbatim}
struct Object {
   int id;                              // Object IDs
   float xcen;                          // x-coordinate of centre
   float ycen;                          // y-coordinate of centre
};

typedef struct Object Object;
\end{verbatim}
I wrote a convenience function:
\begin{verbatim}
Object *newObject(const int id, const float xcen, const double ycen) {
   Object obj;

   obj.id = id;
   obj.xcen = xcen;
   obj.ycen = ycen;

   return &obj;
}
#define NOBJECT 1000                    // Maximum number of objects

Object *objs[NOBJECT];                  // our objects

for (int i = 0; i < n; ++i) {
   objs[i] = newObject(i, ...);
}
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Malloc}
\label{sec-5_1_15}


After some time spent in \texttt{gdb}, I remembered: 

\begin{itemize}
\item Variables in subroutines are irretrievably lost when the routine returns
\end{itemize}
and that's exactly what this does:
\begin{verbatim}
Object *newObject(const int id, const float xcen, const double ycen) {
   Object obj;
   ...
   return @\color{red}\&@obj;
}
\end{verbatim}

\pause
The solution is to get a pointer to a piece of persistent memory.  
C provides this via a call to \code{malloc}:
\begin{verbatim}
#include <stdlib.h>

Object *newObject(const int id, const float xcen, const double ycen) {
   Object @\color{red}*@obj = malloc(sizeof(Object));
   ...
   return obj;
}
\end{verbatim}
\pause
Malloc finds the memory you ask for on the \texttt{heap}.
\end{frame}
\begin{frame}[fragile]
\frametitle{Pointers-to-Pointers}
\label{sec-5_1_16}

How about:
\begin{verbatim}
#define NOBJECT 1000                    // Maximum number of objects

Object *objs[NOBJECT];                  // our objects
\end{verbatim}
\pause

We know that
\begin{verbatim}
int i[10];
\end{verbatim}
and
\begin{verbatim}
int *i;
\end{verbatim}
are equivalent (except for the question of where the data lives).\pause{}
We can provide the needed storage with:
\begin{verbatim}
int *i = malloc(10*sizeof(int));
\end{verbatim}

\pause
So:
\begin{verbatim}
n = ...;
Object **objs = malloc(n*sizeof(Object *)); // our objects
\end{verbatim}
\pause
If you don't know \texttt{n} \emph{a priori}, look up the system call \code{realloc}.
\pause
There is also \code{calloc} but I never use it --- initialising to \texttt{0x0} is a blunt weapon.
\end{frame}
\begin{frame}[fragile]
\frametitle{Free}
\label{sec-5_1_17}

As I said, \code{malloc} returns persistent memory, so it's important to return it to the system
when you've finished with it:
\begin{verbatim}
for (int i = 0; i != n; ++i) {
   free(objects[i]);
}
free(objects);
\end{verbatim}
\pause Failure to do so results in a \emph{memory leak}.

\pause
Freeing a piece of memory more than once usually has catastrophic consequences; don't do it.

\pause
Another failure mode is that sometimes \code{malloc} can't give you the memory you want.  In this case it
returns \texttt{0}, conventionally written \texttt{NULL}.  There is not much you can do when this happens, so a reasonable
response is to abort:
\begin{verbatim}
#include <stdlib.h>
#include <assert.h>

Object *newObject(const int id, const float xcen, const double ycen) {
   Object @\color{red}*@obj = malloc(sizeof(Object));
   assert (obj != NULL);
   ...
   return obj;
}
\end{verbatim}
\end{frame}
